&После("ОбработкаПроведения")
Процедура Чеки_ОбработкаПроведения(Отказ, РежимПроведения)
	ВидАналитикиТовар = ПланыВидовХарактеристик.ВидыАналитик.НайтиПоНаименованию("Товар",Истина);
	Для Каждого Строка Из ЭтотОбъект.Расходы Цикл
		Статья = Строка.СтатьяРасходаИмущество;
		ВидыИЗначенияАналитики = Строка.АналитикаСтатьи.ВидыИЗначенияАналитики;
		СтрокаСТоваром = ВидыИЗначенияАналитики.Найти(ВидАналитикиТовар,"ВидАналитики");
		РегистрыСведений.Чеки_СоответствиеТоваровИСтатей.ДополнитьСоответствие(Статья,СтрокаСТоваром.ЗначениеАналитики);
	КонецЦикла;
КонецПроцедуры

